# 1. Вычислить число c заданной точностью d
# Пример:
# - при d = 0.001, π = 3.142,    10^(-1) ≤ d ≤10^(-10)

n = float(input("Введите число : ").replace(',', '.'))
d = float(input("Задайте точность : ").replace(',', '.'))
s = str(d)
num = (abs(s.find('.') - len(s)) - 1)

print(f'число {n} с точностью {d} => {round(n, num)}')
